In [4]:
#lets import pandas
import numpy as np
import pandas as pd

# Reindex function is used to reorder the index in the dataframe

it means it changes the row labels and column labels of a dataframe

In [6]:
index = ["Firefox", "Chrome", "Safari", "IE10", "Konqueror"]
df = pd.DataFrame({"http_status": [200,400,404, 404, 301], "response_time": [0.04,0.02,0.07,0.08,1.0]},
                 index=index)
df

           http_status  response_time
Firefox            200           0.04
Chrome             400           0.02
Safari             404           0.07
IE10               404           0.08
Konqueror          301           1.00

In [7]:
#create a new order of index 
new_index = ["Safari", "Iceweasel", "Comodo Dragon", "IE10", "Chrome"]

#apply the new order of index
df.reindex(new_index)

               http_status  response_time
Safari               404.0           0.07
Iceweasel              NaN            NaN
Comodo Dragon          NaN            NaN
IE10                 404.0           0.08
Chrome               400.0           0.02

# Reset Index: It is used to Reset the index or Convert an Index into a column

In [8]:
#create a dataframe
df = pd.DataFrame([("bird", 389.0), ("bird", 24.0),("mammal", 80.5),("mammal", np.nan)], index=["falcon", "parrot",
                                                                                               "lion", "monkey"],
                 columns=("class", "max_speed"))
df

         class  max_speed
falcon    bird      389.0
parrot    bird       24.0
lion    mammal       80.5
monkey  mammal        NaN

In [9]:
# convert the index into column
df.reset_index()

    index   class  max_speed
0  falcon    bird      389.0
1  parrot    bird       24.0
2    lion  mammal       80.5
3  monkey  mammal        NaN

In [10]:
# remove the index completely
df.reset_index(drop=True)

    class  max_speed
0    bird      389.0
1    bird       24.0
2  mammal       80.5
3  mammal        NaN

# Sort index: ot is used to sort the index

In [11]:
df = pd.DataFrame({"month": [1,4,7,10],"year": [2012, 2014, 2013,2014], "sale": [55,40,84,31]})
df

   month  year  sale
0      1  2012    55
1      4  2014    40
2      7  2013    84
3     10  2014    31

In [12]:
df["sale"].sort_values()

3    31
1    40
0    55
2    84
Name: sale, dtype: int64

In [13]:
df["sale"].sort_index()

0    55
1    40
2    84
3    31
Name: sale, dtype: int64

# Set Index : it is set a column into an index

In [14]:
df = pd.DataFrame({"month": [1,4,7,10],"year": [2012, 2014, 2013,2014], "sale": [55,40,84,31]})
df

   month  year  sale
0      1  2012    55
1      4  2014    40
2      7  2013    84
3     10  2014    31

In [15]:
# set the month column into an index
df.set_index("month")

       year  sale
month
1      2012    55
4      2014    40
7      2013    84
10     2014    31